:PROPERTIES:
:ID: 23DF494F-F41E-42F4-8F49-2341C9F7ABFE
:END:
#+title: Listen
#+description: Listen
#+type: recipe
#+level: cross
#+filetags: :recipe:shell:events:
#+created: 2026-05-21
#+updated: 2026-05-21

Subscribe to notifications for an event type.

#+name: events-listen
#+begin_src ores-shell :exports none
events listen ores.refdata.currency_changed
events subscriptions
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args} << 'EOF'
<<events-listen>>
EOF
#+end_src

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser3
ORE Studio Shell REPL v0.0.8
Type 'help' for available commands, 'exit' to quit.

ores-shell> ✓ Listening on ores.refdata.currency_changed
ores-shell> Active subscriptions:
  • ores.refdata.currency_changed
ores-shell> Bye!
#+end_example
